app/controllers/posts_controller.rb

INSERT INTO "posts" ("cotent", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cotent", "first ever shout! "], ["user_id", 2], ["created_at", "2016-06-27 20:43:29.203807"], ["updated_at", "2016-06-27 20:43:29.203807"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if (@post.save)